#language: ru

  Функциональность: Профиль
    Сценарий: Успешное заполнение профиля данными
      Когда Я проверяю корректность текста кнопки на главном экране
      И Я перехожу к редактированию профиля
      И Я проверяю кнопку назад
      И Я проверяю валидацию полей PersonalDate
      И Я указываю фамилию
      И Я указываю имя
      И Я указываю отчество
      И Я указываю дату рождения
      И Я перехожу далее
      И Я выбираю город
      И Я перехожу далее1
      И Я указываю интересы
      И Я перехожу далее2
      И Я указываю информацию о себе и сохраняю данные
      И Я перехожу к редактированию профиля2
      Тогда Я вижу указанные ФИО
      И Я вижу указанную дату рождения
      Когда Я перехожу далее3
      Тогда Я вижу указанный город
      Когда Я перехожу далее4
      Тогда Я вижу указанные интересы
      Когда Я перехожу далее5
      Тогда Я вижу указанную информацию о себе
